[
    {
        "title": "Racist videos made with AI are going viral on TikTok",
        "link": "https://www.theverge.com/news/697188/racist-ai-generated-videos-google-veo-3-tiktok",
        "description": "Racist videos that appear to be created with Google’s AI video generation tool Veo 3 have raked in millions of views across TikTok, according to findings from the nonprofit media watchdog Media Matters. The AI-generated videos uncovered by the organization are filled with racist tropes, many of which target Black people. Media Matters determined that [&#8230;]",
        "published": "2025-07-02T18:01:44-04:00"
    },
    {
        "title": "Blizzard is winding down support for its Warcraft mobile game",
        "link": "https://www.theverge.com/news/697128/warcraft-rumble-maintenance-mode-microsoft-layoffs",
        "description": "Microsoft’s layoff of roughly 9,000 employees is continuing to have downstream effects at the company’s subsidiaries. Aftermath reports that as many as 100 developers at Blizzard have been impacted, and as a result the studio is winding down development on its mobile tower defense game Warcraft Rumble. In an announcement, Blizzard wrote that while the [&#8230;]",
        "published": "2025-07-02T17:11:54-04:00"
    },
    {
        "title": "Google’s fix for Pixel 6A battery overheating issues arrives next week",
        "link": "https://www.theverge.com/news/697103/google-android16-update-pixel-6a-battery-overheating-fix-july-8",
        "description": "A mandatory update for Google’s mid-range Pixel 6A phones is coming next week that is meant to reduce the risk of the battery overheating on some devices. According to a support page post, Google is issuing the mandatory Android 16 update starting July 8 to all Pixel 6A devices. However, only users with “Impacted Devices” [&#8230;]",
        "published": "2025-07-02T16:42:23-04:00"
    },
    {
        "title": "Xbox hit hard with layoffs: from canceled games to a shuttered studio",
        "link": "https://www.theverge.com/news/697125/microsoft-xbox-layoffs-2025",
        "description": "On July 2nd, Microsoft announced sweeping layoffs affecting as many as 9,000 employees, and they had a big impact on the company’s Xbox studios. Microsoft canceled Perfect Dark from The Initiative and closed the studio. Rare&#8217;s Everwild, announced in 2019, was canceled, too. And Forza Motorsport developer Turn 10 Studios will lose more than 70 [&#8230;]",
        "published": "2025-07-02T16:36:32-04:00"
    },
    {
        "title": "How Nintendo locked down the Switch 2’s USB-C port and broke third-party docking",
        "link": "https://www.theverge.com/report/695915/switch-2-usb-c-third-party-docks-dont-work-authentication-encryption",
        "description": "There's always a reason why universal USB-C ports don't \"just work\" like you'd expect. In the early days, it was incompetence or naivet&#233;. Later, manufacturers often cheaped out. But in the case of Nintendo's Switch 2, it appears to be intentional. With the Nintendo Switch 2, it should be easy to plug your new, more [&#8230;]",
        "published": "2025-07-02T15:47:45-04:00"
    },
    {
        "title": "Phil Spencer isn’t retiring as the chief of Xbox ‘anytime soon’",
        "link": "https://www.theverge.com/news/696922/phil-spencer-xbox-microsoft-gaming-retiring",
        "description": "Microsoft says that Phil Spencer, Microsoft Gaming CEO and the head of Xbox, isn’t retiring “anytime soon.” The company has responded to rumors of Spencer’s retirement, which have spread online today following Microsoft’s major layoffs. “Phil is not retiring anytime soon,” says Kari Perez, head of Xbox communications, in a statement to The Verge. The [&#8230;]",
        "published": "2025-07-02T15:40:27-04:00"
    },
    {
        "title": "Zelle needs to fix &#8216;significant scams and fraud,&#8217; lawmakers say",
        "link": "https://www.theverge.com/news/696786/lawmakers-warren-blumenthal-zelle-scams-bank-letters",
        "description": "Banks are facing renewed pressure to protect their customers from scams on Zelle, the payment network owned by JPMorgan, Wells Fargo, Bank of America, Capital One, and other big banks. In letters to the banks, Sen. Elizabeth Warren (D-MA), Sen. Richard Blumenthal (D-CT), and Rep. Maxine Waters (D-CA) asked them how often their customers report [&#8230;]",
        "published": "2025-07-02T15:30:00-04:00"
    },
    {
        "title": "Here are 25 of our favorite deals from Amazon’s early Prime Day sale",
        "link": "https://www.theverge.com/tech/692002/amazon-prime-day-best-early-deals-2025",
        "description": "Amazon’s next Prime Day event hasn’t officially kicked off yet, but as usual, the retailer has already dropped a selection of early deals ahead of its four-day sale that begins July 8th. While steeper discounts will surely arrive shortly, many of the current offers are already worth considering, especially if you&#8217;re a Prime member looking [&#8230;]",
        "published": "2025-07-02T15:01:54-04:00"
    },
    {
        "title": "Three former Ubisoft executives are convicted of sexual and psychological harassment",
        "link": "https://www.theverge.com/games/696996/ubisoft-me-too-former-executive-convictions",
        "description": "A court in France has sentenced three former Ubisoft executives for sexual and psychological harassment. Serge Hascoet, Tommy Francois, and Guillaume Patrux each received fines and suspended prison sentences for actions that were discovered as a part of a yearslong investigation into sexual harassment and bullying at the game publisher. According to The Guardian, Hascoet, [&#8230;]",
        "published": "2025-07-02T14:54:08-04:00"
    },
    {
        "title": "Amazon is offering a like-new Kindle Paperwhite 2024 for just $107",
        "link": "https://www.theverge.com/tech/696906/kindle-paperwhite-refurbished-deal-sale",
        "description": "With less than a week until Prime Day kicks off, we’re already seeing some exciting early deals pop up. And now we can add two more great discounts to the list: the refurbished ad-supported Kindle Paperwhite is down to $106.99 ($37 off) at Amazon, while the refurbished Kindle Paperwhite Signature Edition is $126.99 ($53 off) [&#8230;]",
        "published": "2025-07-02T14:20:45-04:00"
    }
]